"""
@date:2020-07-27
@time：20:03
@author:smq
@description:描述
"""
from App import app


@app.template_filter('dictSortBy')
def dictSortBy(value, key):
    res = sorted(value, key=lambda x: x[key], reverse=True)
    return res


@app.template_filter('choose')
def choose(value, a, b):
    if value == 0:
        return a
    else:
        return b


@app.template_filter('lastPiece')
def lastPiece(value):
    return value[len(value) - 1]


if __name__ == '__main__':
    vv = [
        {
            "商品ID": "605635862044",
            "商品名称": "Pro眼霜",
            "访客数": 6592,
            "销售额": 56853.2617,
            "买家数": 437,
            "转化率": 0.0663,
            "客单价": 128.0479,
            "收藏人数": 273,
            "销售占比": 0.0595
        },
        {
            "商品ID": "608307748293",
            "商品名称": "A醇",
            "访客数": 206,
            "销售额": 675.0,
            "买家数": 5,
            "转化率": 0.0243,
            "客单价": 135.0,
            "收藏人数": 12,
            "销售占比": 0.0007
        },
        {
            "商品ID": "35399645973",
            "商品名称": "冰川套装",
            "访客数": 13602,
            "销售额": 49424.1211,
            "买家数": 377,
            "转化率": 0.0277,
            "客单价": 127.7109,
            "收藏人数": 478,
            "销售占比": 0.0517
        },
        {
            "商品ID": "526250011782",
            "商品名称": "30g美白防晒",
            "访客数": 979,
            "销售额": 1886.0,
            "买家数": 25,
            "转化率": 0.0255,
            "客单价": 69.8519,
            "收藏人数": 32,
            "销售占比": 0.002
        },
        {
            "商品ID": "593810916668",
            "商品名称": "薇娅安瓶",
            "访客数": 224,
            "销售额": 504.0,
            "买家数": 2,
            "转化率": 0.0089,
            "客单价": 168.0,
            "收藏人数": 8,
            "销售占比": 0.0005
        },
        {
            "商品ID": "521952626778",
            "商品名称": "紧致礼盒",
            "访客数": 1204,
            "销售额": 3370.0,
            "买家数": 9,
            "转化率": 0.0075,
            "客单价": 337.0,
            "收藏人数": 23,
            "销售占比": 0.0035
        },
        {
            "商品ID": "535575862926",
            "商品名称": "雪润气垫",
            "访客数": 857,
            "销售额": 2205.3501,
            "买家数": 19,
            "转化率": 0.0222,
            "客单价": 110.2675,
            "收藏人数": 36,
            "销售占比": 0.0023
        },
        {
            "商品ID": "544864793945",
            "商品名称": "人鱼膜法-21片",
            "访客数": 1349,
            "销售额": 939.92,
            "买家数": 8,
            "转化率": 0.0059,
            "客单价": 117.49,
            "收藏人数": 17,
            "销售占比": 0.001
        },
        {
            "商品ID": "591792639412",
            "商品名称": "水光白修护礼盒",
            "访客数": 707,
            "销售额": 2562.0,
            "买家数": 8,
            "转化率": 0.0113,
            "客单价": 320.25,
            "收藏人数": 20,
            "销售占比": 0.0027
        },
        {
            "商品ID": "16541174270",
            "商品名称": "冰川美容液",
            "访客数": 645,
            "销售额": 2045.0,
            "买家数": 23,
            "转化率": 0.0357,
            "客单价": 81.8,
            "收藏人数": 12,
            "销售占比": 0.0021
        },
        {
            "商品ID": "21176872955",
            "商品名称": "冰川补水霜",
            "访客数": 453,
            "销售额": 1120.28,
            "买家数": 19,
            "转化率": 0.0419,
            "客单价": 58.9621,
            "收藏人数": 20,
            "销售占比": 0.0012
        },
        {
            "商品ID": "520987824839",
            "商品名称": "海泉精华水",
            "访客数": 452,
            "销售额": 1494.9301,
            "买家数": 17,
            "转化率": 0.0376,
            "客单价": 87.9371,
            "收藏人数": 14,
            "销售占比": 0.0016
        },
        {
            "商品ID": "544842582800",
            "商品名称": "修颜隔离乳",
            "访客数": 767,
            "销售额": 2829.0,
            "买家数": 40,
            "转化率": 0.0522,
            "客单价": 69.0,
            "收藏人数": 29,
            "销售占比": 0.003
        },
        {
            "商品ID": "36442399390",
            "商品名称": "冰川洁面乳",
            "访客数": 1868,
            "销售额": 6875.6099,
            "买家数": 152,
            "转化率": 0.0814,
            "客单价": 39.515,
            "收藏人数": 64,
            "销售占比": 0.0072
        },
        {
            "商品ID": "37874885829",
            "商品名称": "海泉套装",
            "访客数": 3882,
            "销售额": 18953.9199,
            "买家数": 96,
            "转化率": 0.0247,
            "客单价": 195.4012,
            "收藏人数": 117,
            "销售占比": 0.0198
        },
        {
            "商品ID": "41681863329",
            "商品名称": "补水面膜",
            "访客数": 26532,
            "销售额": 139692.7188,
            "买家数": 6610,
            "转化率": 0.2491,
            "客单价": 20.8777,
            "收藏人数": 640,
            "销售占比": 0.1461
        }
    ]
